#### **Read Customer Data:**

In [3]:
import pandas as pd

In [4]:
cust_df = pd.read_csv("customer_data.csv")

In [5]:
cust_df.head()

,CustomerID,Name,Email,DateOfBirth,RegistrationDate,Country,MonthlySpend
0,1,John Doe,johndoe@example.com,2/15/1985,2024-01-12,United States,200.0
1,2,Jane Smith,janesmith@example.com,8/20/1990,NaN,United States,300.0
2,3,Alan Brown,alanbrown@example.com,1/15/1975,2024-02-05,Canada,150.0
3,4,Eva White,evawhite@example.com,7/30/1987,2024-02-15,united states,400.0
4,5,Mark Black,markblack@example.com,2/12/1982,2024-02-15,Canada,NaN

#### **Change the datatype of the columns:**

In [6]:
cust_df['DateOfBirth'] = pd.to_datetime(cust_df['DateOfBirth'],errors='coerce')
cust_df['RegistrationDate'] = pd.to_datetime(cust_df['RegistrationDate'],errors='coerce')

In [7]:
cust_df.dtypes

CustomerID                   int64
Name                        object
Email                       object
DateOfBirth         datetime64[ns]
RegistrationDate    datetime64[ns]
Country                     object
MonthlySpend               float64
dtype: object

### **Data Cleansing**

#### **Handling missing values:**

In [8]:
print(cust_df.isna().sum())

CustomerID          0
Name                0
Email               0
DateOfBirth         1
RegistrationDate    1
Country             0
MonthlySpend        3
dtype: int64

In [9]:
cust_df['RegistrationDate'].fillna('2024-08-26',inplace = True)

C:\Users\PratikSingh\AppData\Local\Temp\ipykernel_23264\203622516.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust_df['RegistrationDate'].fillna('2024-08-26',inplace = True)

In [10]:
cust_df['DateOfBirth'].fillna('31/12/1999',inplace = True)

C:\Users\PratikSingh\AppData\Local\Temp\ipykernel_23264\2680093630.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust_df['DateOfBirth'].fillna('31/12/1999',inplace = True)

In [11]:
cust_df['MonthlySpend'].fillna(0,inplace = True)

C:\Users\PratikSingh\AppData\Local\Temp\ipykernel_23264\3803687305.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust_df['MonthlySpend'].fillna(0,inplace = True)

#### **Standardize data formats (YYYY-MM-DD):**

In [12]:
cust_df['DateOfBirth'] = pd.to_datetime(cust_df['DateOfBirth'],format = '%y-%m-%d')

In [13]:
cust_df.head()

,CustomerID,Name,Email,DateOfBirth,RegistrationDate,Country,MonthlySpend
0,1,John Doe,johndoe@example.com,1985-02-15,2024-01-12,United States,200.0
1,2,Jane Smith,janesmith@example.com,1990-08-20,2024-08-26,United States,300.0
2,3,Alan Brown,alanbrown@example.com,1975-01-15,2024-02-05,Canada,150.0
3,4,Eva White,evawhite@example.com,1987-07-30,2024-02-15,united states,400.0
4,5,Mark Black,markblack@example.com,1982-02-12,2024-02-15,Canada,0.0

#### **Trim the white space:**

In [14]:
cust_df['Country'] = cust_df['Country'].str.strip()

In [15]:
cust_df.head()

,CustomerID,Name,Email,DateOfBirth,RegistrationDate,Country,MonthlySpend
0,1,John Doe,johndoe@example.com,1985-02-15,2024-01-12,United States,200.0
1,2,Jane Smith,janesmith@example.com,1990-08-20,2024-08-26,United States,300.0
2,3,Alan Brown,alanbrown@example.com,1975-01-15,2024-02-05,Canada,150.0
3,4,Eva White,evawhite@example.com,1987-07-30,2024-02-15,united states,400.0
4,5,Mark Black,markblack@example.com,1982-02-12,2024-02-15,Canada,0.0

#### **Standardize the Country field to have consistent capitalization:**

In [16]:
cust_df['Country'] = cust_df['Country'].str.capitalize()

In [17]:
cust_df.head()

,CustomerID,Name,Email,DateOfBirth,RegistrationDate,Country,MonthlySpend
0,1,John Doe,johndoe@example.com,1985-02-15,2024-01-12,United states,200.0
1,2,Jane Smith,janesmith@example.com,1990-08-20,2024-08-26,United states,300.0
2,3,Alan Brown,alanbrown@example.com,1975-01-15,2024-02-05,Canada,150.0
3,4,Eva White,evawhite@example.com,1987-07-30,2024-02-15,United states,400.0
4,5,Mark Black,markblack@example.com,1982-02-12,2024-02-15,Canada,0.0

#### **Calculate a new column “Age” from DateOfBirth:**

In [18]:
from datetime import date

In [19]:
curr = date.today()

In [20]:
curr

datetime.date(2024, 8, 26)

In [21]:
cust_df['Age'] = curr.year-cust_df['DateOfBirth'].dt.year

#### **Save the cleaned and transformed data into cleaned_customer_data.csv:**

In [22]:
cust_df.to_csv("cleaned_customer_data.csv")

In [23]:
cust_df

,CustomerID,Name,Email,DateOfBirth,RegistrationDate,Country,MonthlySpend,Age
0,1,John Doe,johndoe@example.com,1985-02-15,2024-01-12,United states,200.0,39
1,2,Jane Smith,janesmith@example.com,1990-08-20,2024-08-26,United states,300.0,34
2,3,Alan Brown,alanbrown@example.com,1975-01-15,2024-02-05,Canada,150.0,49
3,4,Eva White,evawhite@example.com,1987-07-30,2024-02-15,United states,400.0,37
4,5,Mark Black,markblack@example.com,1982-02-12,2024-02-15,Canada,0.0,42
5,6,Lisa Green,lisagreen@example.com,1979-10-19,2024-04-10,United kingdom,250.0,45
6,7,Paul Blue,paulblue@example.com,1983-11-03,2024-01-28,United kingdom,0.0,41
7,8,Alice Pink,alicepink@example.com,1977-04-22,2024-05-18,Mexico,450.0,47
8,9,Mary Orange,maryorange@example.com,1999-12-31,2024-02-22,France,300.0,25
9,10,Chris Gray,chrisgray@example.com,1986-12-11,2024-03-01,United states,0.0,38